app/controllers/decks_controller.rb

  def start
    return redirect_to decks_path if Deck.exists?
---
SELECT 1 AS one FROM "decks" LIMIT ?  [["LIMIT", 1]]

  def index
    @query = params[:q].to_s.strip
    base_scope = Deck.includes(:flashcards).order(updated_at: :desc)
---
SELECT DISTINCT "decks".* FROM "decks" LEFT OUTER JOIN "flashcards" ON "flashcards"."deck_id" = "decks"."id" WHERE (decks.title LIKE '%macaco%' OR decks.description LIKE '%macaco%' OR flashcards.term LIKE '%macaco%' OR flashcards.definition LIKE '%macaco%') ORDER BY "decks"."updated_at" DESC

  def new
    @has_decks = Deck.table_exists? && Deck.exists?
    @relative_time_label = "Last created"
    @relative_time_empty = "No decks created yet"
    @relative_time_timestamp = Deck.maximum(:created_at) if @has_decks
---
SELECT 1 AS one FROM "decks" LIMIT ?  [["LIMIT", 1]]
SELECT MAX("decks"."created_at") FROM "decks"

  def edit
    @has_decks = Deck.table_exists? && Deck.exists?
    @deck = Deck.includes(:flashcards).find(params[:id])
    set_edit_relative_time
    @deck.flashcards.build(position: 0) if @deck.flashcards.empty?
---
SELECT 1 AS one FROM "decks" LIMIT ?  [["LIMIT", 1]]
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "flashcards".* FROM "flashcards" WHERE "flashcards"."deck_id" = ? ORDER BY "flashcards"."position" ASC, "flashcards"."id" ASC  [["deck_id", 8]]

  def practice
    @deck = Deck.includes(:flashcards).find(params[:id])
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def create
    if params[:commit_action] == "import" && params[:import_payload].present?
      return handle_import
    end

    @deck = Deck.new(deck_params)
    normalize_flashcard_positions

    if @deck.save
      return redirect_to practice_deck_path(@deck) if params[:commit_action] == "practice"
      return redirect_to(edit_deck_path(@deck), flash: { imported: true }) if params[:commit_action] == "import"

      flash[:saved] = true
      redirect_to new_deck_path
    else
      @has_decks = Deck.table_exists? && Deck.exists?
      @relative_time_label = "Last created"
      @relative_time_empty = "No decks created yet"
      @relative_time_timestamp = Deck.maximum(:created_at) if @has_decks
      @deck.flashcards.build(position: @deck.flashcards.length) if @deck.flashcards.empty?
---
INSERT INTO "decks" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "Biology Basics"], ["description", "Cell and genetics review"], ["created_at", "2026-04-06 00:41:32.050017"], ["updated_at", "2026-04-06 00:41:32.050017"]]
SELECT 1 AS one FROM "decks" LIMIT ?  [["LIMIT", 1]]
SELECT "flashcards".* FROM "flashcards" WHERE "flashcards"."deck_id" = ? ORDER BY "flashcards"."position" ASC, "flashcards"."id" ASC  [["deck_id", 8]]

  def update
    if params[:commit_action] == "import" && params[:import_payload].present?
      return handle_import
    end

    @deck = Deck.includes(:flashcards).find(params[:id])
    @has_decks = Deck.table_exists? && Deck.exists?
    set_edit_relative_time

    @deck.assign_attributes(deck_params)
    normalize_flashcard_positions

    if @deck.save
      return redirect_to practice_deck_path(@deck) if params[:commit_action] == "practice"
      return redirect_to(edit_deck_path(@deck), flash: { imported: true }) if params[:commit_action] == "import"

      flash[:saved] = true
      redirect_to edit_deck_path(@deck)
    else
      set_edit_relative_time
      @deck.flashcards.build(position: @deck.flashcards.length) if @deck.flashcards.empty?
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT 1 AS one FROM "decks" LIMIT ?  [["LIMIT", 1]]
UPDATE "flashcards" SET "term" = ?, "definition" = ?, "updated_at" = ? WHERE "flashcards"."id" = ?  [["term", "Cell membrane"], ["definition", "Controls what enters and leaves the cell."], ["updated_at", "2026-04-06 00:40:11.959444"], ["id", 10]]
UPDATE "decks" SET "title" = ?, "updated_at" = ? WHERE "decks"."id" = ?  [["title", "Astronomy 101eee"], ["updated_at", "2026-04-06 01:28:24.480840"], ["id", 15]]
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "flashcards".* FROM "flashcards" WHERE "flashcards"."deck_id" = ? ORDER BY "flashcards"."position" ASC, "flashcards"."id" ASC  [["deck_id", 8]]

  def destroy
    deck = Deck.find(params[:id])
    deck.destroy
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "decks" WHERE "decks"."id" = ?  [["id", 9]]

  def import_decks_from_payload(raw_payload)
    payload = JSON.parse(raw_payload)
    decks = payload.is_a?(Hash) ? payload["decks"] : nil
    raise ArgumentError, "Wrong template format" unless decks.is_a?(Array) && decks.any?

    created = []
    duplicate_skipped = 0
    existing_titles = Deck.pluck(:title).map { |title| normalize_import_title(title) }
---
SELECT "decks"."title" FROM "decks"

          )
        end

        deck.save!
---
INSERT INTO "decks" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "Biology Basics"], ["description", "Cell and genetics review"], ["created_at", "2026-04-06 00:47:57.405783"], ["updated_at", "2026-04-06 00:47:57.405783"]]