app/controllers/home_controller.rb

  def index
    @has_decks = Deck.table_exists? && Deck.exists?
---
SELECT 1 AS one FROM "decks" LIMIT ?  [["LIMIT", 1]]